app/views/links/index.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."link_id" = ?  [["link_id", 3]]
---
    <h5 class="comments_title">
  <%= link.comments.count %> Comments