app/controllers/links_controller.rb

    def search_results
      @found_links = Link.keyword_search(params[:search_keywords]).order_list(params[:sort_by])
---
SELECT "links".* FROM "links" WHERE (title LIKE '%Daily Mail%' OR category_id LIKE '%Daily Mail%' OR publisher LIKE '%Daily Mail%' OR writer LIKE '%Daily Mail%')  ORDER BY "links"."created_at" DESC

  def index
  if params[:category].blank?
			@links = Link.all.order_list(params[:sort_by])
	else
			@category_id = Category.find_by(name: params[:category]).id
			@links = Link.where(:category_id => @category_id).order_list(params[:sort_by])
---
SELECT "categories".* FROM "categories"
SELECT "links".* FROM "links"  ORDER BY "links"."created_at" DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT 1  [["name", "Politics"]]
SELECT "links".* FROM "links" WHERE "links"."category_id" = ?  ORDER BY "links"."created_at" DESC  [["category_id", 1]]

  def new
    @link = current_user.links.build
    @categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

  def edit
    @categories = Category.all.map{ |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

  def create
    @link = current_user.links.build(link_params)
    @link.category_id = params[:category_id]

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "publisher", "writer", "summary", "user_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @link.category_id = params[:category_id]
    respond_to do |format|
      if @link.update(link_params)
---
UPDATE "links" SET "publisher" = ?, "writer" = ?, "updated_at" = ? WHERE "links"."id" = ?  [["publisher", "Breitbart"], ["writer", "Kristina Wong"], ["updated_at", "2017-03-31 15:24:04.330628"], ["id", 1]]

  def destroy
    @link.destroy
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]

  def downvote
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 6]]

    def set_link
      @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]